step-2/load-test/get-all-books-view-details.yml
config:
    target: "https://CHANGEME.apigateway.us-ashburn-1.oci.customer-oci.com/v1"
    phases:
      - duration: 10
        arrivalRate: 1
        name: Warm up
      - duration: 20
        arrivalRate: 1
        rampTo: 2
        name: Ramp up load
      - duration: 60
        arrivalRate: 2
        name: Sustained load
    variables:
      id:
        - "1234"
        - "ED411A2E5BA34705ADA4835C9C37FF39"
        - "4DCEFCD41B8345DC8B1035598252BEEC"
        - "DA8803A9BFB14070964D4DB49478C6FA"
        - "1A9B0CBFB1D8411E88E140E9DAD19D76"
        - "076DA47A4377430C9239D1098400B259"
scenarios:
    # We define one scenario:
    - name: "Browse all books"
      flow:
        - get:
            url: "/dbooks"
        # Get the details of the book:
        - get:
            url: "/books/{{ id }}"